{
  "users": [
    {
      "email": "david@david.com",
      "password": "apod",
      "name": "david b",
      "id": 1
    },
    {
      "email": "jake@jake.com",
      "password": "apod",
      "name": "jake b",
      "id": 2
    },
    {
      "email": "jisie.david@nashvillesoftwareschool.com",
      "password": "apod",
      "name": "jisie d",
      "id": 3
    }
  ],
  "photos": [
    {
      "userId": 1,
      "noteText": "It's happening. Saturn and Jupiter are moving closer and will soon appear in almost exactly the same direction. Coincidentally, on the night of the December solstice -- the longest night of the year in the north and the longest day in the south -- the long-awaited Great Conjunction will occur. Then, about six days from now, Saturn and Jupiter will be right next to each other -- as they are every 20 years. But this juxtaposition is not just any Great Conjunction -- it will be the closest since 1623 because the two planetary giants will pass only 1/10th of a degree from each other -- well less than the apparent diameter of a full moon. In the next few days a crescent moon will also pass a few degrees away from the converging planets and give a preliminary opportunity for iconic photos. The featured illustration shows the approach of Saturn and Jupiter during November and December over the French Alps. Growing Gallery: Notable images of the Great Conjunction submitted to APOD",
      "title": "Great Conjunction: Saturn and Jupiter Converge",
      "imageUrl": "https://apod.nasa.gov/apod/image/2012/SaturnJupiter_Voltmer_960.jpg",
      "date": "2020-12-15",
      "id": 7
    },
    {
      "userId": 3,
      "noteText": "Dust pillars are like interstellar mountains. They survive because they are more dense than their surroundings, but they are being slowly eroded away by a hostile environment. Visible in the featured picture is the end of a huge gas and dust pillar in the Trifid Nebula (M20), punctuated by a smaller pillar pointing up and an unusual jet pointing to the left. Many of the dots are newly formed low-mass stars. A star near the small pillar's end is slowly being stripped of its accreting gas by radiation from a tremendously brighter star situated off the top of the image. The jet extends nearly a light-year and would not be visible without external illumination. As gas and dust evaporate from the pillars, the hidden stellar source of this jet will likely be uncovered, possibly over the next 20,000 years. Growing Gallery: Notable images of the Great Conjunction submitted to APOD",
      "title": "Trifid Pillars and Jets",
      "imageUrl": "https://apod.nasa.gov/apod/image/2012/Trifid_HubbleMehla_1080.jpg",
      "date": "",
      "id": 8
    },
    {
      "userId": 1,
      "noteText": "Big, beautiful spiral galaxy NGC 1055 is a dominant member of a small galaxy group a mere 60 million light-years away toward the aquatically intimidating constellation Cetus. Seen edge-on, the island universe spans over 100,000 light-years, a little larger than our own Milky Way galaxy. The colorful, spiky stars decorating this cosmic portrait of NGC 1055 are in the foreground, well within the Milky Way. But the telltale pinkish star forming regions are scattered through winding dust lanes along the distant galaxy's thin disk. With a smattering of even more distant background galaxies, the deep image also reveals a boxy halo that extends far above and below the central bluge and disk of NGC 1055. The halo itself is laced with faint, narrow structures, and could represent the mixed and spread out debris from a satellite galaxy disrupted by the larger spiral some 10 billion years ago.",
      "title": "Portrait of NGC 1055",
      "imageUrl": "https://apod.nasa.gov/apod/image/2012/NGC1055_MP_1024c.jpg",
      "date": "2020-12-24",
      "id": 13
    },
    {
      "userId": 1,
      "noteText": "When the shadow of the Moon raced across planet Earth's southern hemisphere on December 14, sky watchers along the shadow's dark central path were treated to the only total solar eclipse of 2020. During the New Moon's shadow play this glistening diamond ring was seen for a moment, even in cloudy skies. Known as the diamond ring effect, the transient spectacle actually happens twice. Just before and immediately after totality, a thin sliver of solar disk visible behind the Moon's edge creates the appearance of a shiny jewel set in a dark ring. This dramatic snapshot from the path of totality in northern Patagonia, Argentina captures this eclipse's second diamond ring, along with striking solar prominences lofted beyond the edge of the Moon's silhouette.",
      "title": "Diamond in the Sky",
      "imageUrl": "https://apod.nasa.gov/apod/image/2012/2020Dec14TSE_Ribas_IMG_9291c1024.jpg",
      "date": "2020-12-18",
      "id": 14
    },
    {
      "userId": 1,
      "noteText": "Big, beautiful spiral galaxy NGC 1055 is a dominant member of a small galaxy group a mere 60 million light-years away toward the aquatically intimidating constellation Cetus. Seen edge-on, the island universe spans over 100,000 light-years, a little larger than our own Milky Way galaxy. The colorful, spiky stars decorating this cosmic portrait of NGC 1055 are in the foreground, well within the Milky Way. But the telltale pinkish star forming regions are scattered through winding dust lanes along the distant galaxy's thin disk. With a smattering of even more distant background galaxies, the deep image also reveals a boxy halo that extends far above and below the central bluge and disk of NGC 1055. The halo itself is laced with faint, narrow structures, and could represent the mixed and spread out debris from a satellite galaxy disrupted by the larger spiral some 10 billion years ago.",
      "title": "Portrait of NGC 1055",
      "imageUrl": "https://apod.nasa.gov/apod/image/2012/NGC1055_MP_1024c.jpg",
      "date": "",
      "id": 15
    },
    {
      "userId": 1,
      "noteText": "Who's watching whom? The featured image of the Moon through a gap in a wall of rock may appear like a giant eye looking back at you. Although, in late October, it took only a single exposure to capture this visual double, it also took a lot of planning. The photographic goal was achieved by precise timing -- needed for a nearly full moon to appear through the eye-shaped arch, by precise locating -- needed for the angular size of the Moon to fit iconically inside the rock arch, and by good luck -- needed for a clear sky and for the entire scheme to work. The seemingly coincidental juxtaposition was actually engineered with the help of three smartphone apps. The pictured sandstone arch, carved by erosion, is millions of years old and just one of thousands of natural rock arches that have been found in Arches National Park near Moab, Utah, USA. Contrastingly, the pictured Moon can be found up in the sky from just about anywhere on Earth, about half the time.",
      "title": "Eye of Moon",
      "imageUrl": "https://apod.nasa.gov/apod/image/2012/MoonEye_Cooley_960.jpg",
      "date": "2020-12-02",
      "id": 16
    },
    {
      "userId": 1,
      "noteText": "As telescopes around planet Earth watch, Mars is growing brighter in night skies, approaching its 2020 opposition on October 13. Mars looks like it's watching too in this view of the Red Planet from September 22. Mars' disk is already near its maximum apparent size for earthbound telescopes, less than 1/80th the apparent diameter of a Full Moon. The seasonally shrinking south polar cap is at the bottom and hazy northern clouds are at the top. A circular, dark albedo feature, Solis Lacus (Lake of the Sun), is just below and left of disk center. Surrounded by a light area south of Valles Marineris, Solis Lacus looks like a planet-sized pupil, famously known as The Eye of Mars . Near the turn of the 20th century, astronomer and avid Mars watcher Percival Lowell associated the Eye of Mars with a conjunction of canals he charted in his drawings of the Red Planet. Broad, visible changes in the size and shape of the Eye of Mars are now understood from high resolution surface images to be due to dust transported by winds in the thin Martian atmosphere.",
      "title": "Solis Lacus: The Eye of Mars",
      "imageUrl": "https://apod.nasa.gov/apod/image/2010/m2020_09_22Adp.jpg",
      "date": "2020-10-01",
      "id": 17
    }
  ],
  "tags": [
    {
      "tag": "planet",
      "id": 1
    },
    {
      "tag": "moon",
      "id": 2
    },
    {
      "tag": "constellation",
      "id": 3
    },
    {
      "tag": "solar system",
      "id": 4
    },
    {
      "tag": "Whoa!",
      "id": 5
    }
  ],
  "photoTags": [
    {
      "photoId": 7,
      "tagId": 5,
      "id": 7
    },
    {
      "photoId": 8,
      "tagId": 4,
      "id": 8
    },
    {
      "photoId": 13,
      "tagId": 4,
      "id": 13
    },
    {
      "photoId": 14,
      "tagId": 2,
      "id": 14
    },
    {
      "photoId": 15,
      "tagId": 4,
      "id": 15
    },
    {
      "photoId": 16,
      "tagId": 2,
      "id": 16
    },
    {
      "photoId": 17,
      "tagId": 1,
      "id": 17
    }
  ]
}