{
  "users": [
    {
      "email": "david@david.com",
      "password": "apod",
      "name": "david b",
      "id": 1
    },
    {
      "email": "jake@jake.com",
      "password": "apod",
      "name": "jake b",
      "id": 2
    },
    {
      "email": "jisie.david@nashvillesoftwareschool.com",
      "password": "apod",
      "name": "jisie d",
      "id": 3
    }
  ],
  "photos": [
    {
      "userId": 1,
      "noteText": "Photo of the ISS passing in front of the moon.",
      "title": "ISS Transits Mars",
      "imageUrl": "https://apod.nasa.gov/apod/image/2009/MarsISS_Glenn_1000.jpg",
      "date": "2020-09-23",
      "id": 4
    },
    {
      "userId": 1,
      "noteText": "Sharp telescopic views of NGC 3628 show a puffy galactic disk divided by dark dust lanes. Of course, this deep portrait of the magnificent, edge-on spiral galaxy puts some astronomers in mind of its popular moniker, the Hamburger Galaxy. It also reveals a small galaxy nearby, likely a satellite of NGC 3628, and a faint but extensive tidal tail. The drawn out tail stretches for about 300,000 light-years, even beyond the right edge of the wide frame. NGC 3628 shares its neighborhood in the local universe with two other large spirals M65 and M66 in a grouping otherwise known as the Leo Triplet. Gravitational interactions with its cosmic neighbors are likely responsible for creating the tidal tail, as well as the extended flare and warp of this spiral's disk. The tantalizing island universe itself is about 100,000 light-years across and 35 million light-years away in the northern springtime constellation Leo.",
      "title": "Portrait of NGC 3628",
      "imageUrl": "https://apod.nasa.gov/apod/image/2006/N3628_StefanoCancelli_PaulMortfield1024.jpg",
      "date": "2020-06-04",
      "id": 5
    },
    {
      "userId": 1,
      "noteText": "It's happening. Saturn and Jupiter are moving closer and will soon appear in almost exactly the same direction. Coincidentally, on the night of the December solstice -- the longest night of the year in the north and the longest day in the south -- the long-awaited Great Conjunction will occur. Then, about six days from now, Saturn and Jupiter will be right next to each other -- as they are every 20 years. But this juxtaposition is not just any Great Conjunction -- it will be the closest since 1623 because the two planetary giants will pass only 1/10th of a degree from each other -- well less than the apparent diameter of a full moon. In the next few days a crescent moon will also pass a few degrees away from the converging planets and give a preliminary opportunity for iconic photos. The featured illustration shows the approach of Saturn and Jupiter during November and December over the French Alps. Growing Gallery: Notable images of the Great Conjunction submitted to APOD",
      "title": "Great Conjunction: Saturn and Jupiter Converge",
      "imageUrl": "https://apod.nasa.gov/apod/image/2012/SaturnJupiter_Voltmer_960.jpg",
      "date": "2020-12-15",
      "id": 7
    },
    {
      "userId": 3,
      "noteText": "Dust pillars are like interstellar mountains. They survive because they are more dense than their surroundings, but they are being slowly eroded away by a hostile environment. Visible in the featured picture is the end of a huge gas and dust pillar in the Trifid Nebula (M20), punctuated by a smaller pillar pointing up and an unusual jet pointing to the left. Many of the dots are newly formed low-mass stars. A star near the small pillar's end is slowly being stripped of its accreting gas by radiation from a tremendously brighter star situated off the top of the image. The jet extends nearly a light-year and would not be visible without external illumination. As gas and dust evaporate from the pillars, the hidden stellar source of this jet will likely be uncovered, possibly over the next 20,000 years. Growing Gallery: Notable images of the Great Conjunction submitted to APOD",
      "title": "Trifid Pillars and Jets",
      "imageUrl": "https://apod.nasa.gov/apod/image/2012/Trifid_HubbleMehla_1080.jpg",
      "date": "",
      "id": 8
    },
    {
      "userId": 1,
      "noteText": "It was time for their close-up. Two days ago Jupiter and Saturn passed a tenth of a degree from each other in what is known a Great Conjunction. Although the two planets pass each other on the sky every 20 years, this was the closest pass in nearly four centuries. Taken early in day of the Great Conjunction, the featured multiple-exposure combination captures not only both giant planets in a single frame, but also Jupiter's four largest moons (left to right) Callisto, Ganymede, Io, and Europa -- and Saturn's largest moon Titan. If you look very closely, the clear Chilescope image even captures Jupiter's Great Red Spot. The now-separating planets can still be seen remarkably close -- within about a degree -- as they set just after the Sun, toward the west, each night for the remainder of the year. Gallery: Notable images of the Great Conjunction submitted to APOD",
      "title": "Jupiter Meets Saturn: A Red Spotted Great Conjunction",
      "imageUrl": "https://apod.nasa.gov/apod/image/2012/GreatConjunction_Peach_960.jpg",
      "date": "",
      "id": 9
    },
    {
      "userId": 1,
      "noteText": "It's easy to get lost following the intricate looping filaments in this detailed image of supernova remnant Simeis 147. Also cataloged as Sharpless 2-240 it goes by the popular nickname, the Spaghetti Nebula. Seen toward the boundary of the constellations Taurus and Auriga, it covers nearly 3 degrees or 6 full moons on the sky. That's about 150 light-years at the stellar debris cloud's estimated distance of 3,000 light-years. This composite includes image data taken through narrow-band filters where reddish emission from ionized hydrogen atoms and doubly ionized oxygen atoms in faint blue-green hues trace the shocked, glowing gas. The supernova remnant has an estimated age of about 40,000 years, meaning light from the massive stellar explosion first reached Earth 40,000 years ago. But the expanding remnant is not the only aftermath. The cosmic catastrophe also left behind a spinning neutron star or pulsar, all that remains of the original star's core.",
      "title": "Simeis 147: Supernova Remnant",
      "imageUrl": "https://apod.nasa.gov/apod/image/2012/S147_GeorgesAttard1024.jpg",
      "date": "2020-12-10",
      "id": 11
    },
    {
      "userId": 1,
      "noteText": "Who's watching whom? The featured image of the Moon through a gap in a wall of rock may appear like a giant eye looking back at you. Although, in late October, it took only a single exposure to capture this visual double, it also took a lot of planning. The photographic goal was achieved by precise timing -- needed for a nearly full moon to appear through the eye-shaped arch, by precise locating -- needed for the angular size of the Moon to fit iconically inside the rock arch, and by good luck -- needed for a clear sky and for the entire scheme to work. The seemingly coincidental juxtaposition was actually engineered with the help of three smartphone apps. The pictured sandstone arch, carved by erosion, is millions of years old and just one of thousands of natural rock arches that have been found in Arches National Park near Moab, Utah, USA. Contrastingly, the pictured Moon can be found up in the sky from just about anywhere on Earth, about half the time.",
      "title": "Eye of Moon",
      "imageUrl": "https://apod.nasa.gov/apod/image/2012/MoonEye_Cooley_960.jpg",
      "date": "2020-12-02",
      "id": 12
    }
  ],
  "tags": [
    {
      "tag": "planet",
      "id": 1
    },
    {
      "tag": "moon",
      "id": 2
    },
    {
      "tag": "constellation",
      "id": 3
    },
    {
      "tag": "solar system",
      "id": 4
    },
    {
      "tag": "Whoa!",
      "id": 5
    }
  ],
  "photoTags": [
    {
      "photoId": 4,
      "tagId": 3,
      "id": 4
    },
    {
      "photoId": 5,
      "tagId": 4,
      "id": 5
    },
    {
      "photoId": 7,
      "tagId": 5,
      "id": 7
    },
    {
      "photoId": 8,
      "tagId": 4,
      "id": 8
    },
    {
      "photoId": 9,
      "tagId": 1,
      "id": 9
    },
    {
      "photoId": 11,
      "tagId": 4,
      "id": 11
    },
    {
      "photoId": 12,
      "tagId": 2,
      "id": 12
    }
  ]
}